# Built In Failures Rebar Failures Rebar Crank Cannot Be Added To Shape Property

Source: https://www.revitapidocs.com/2026/76ff45b6-6a59-0a32-db70-d1c108e9c8a0.htm

---

| Built In Failures Rebar Failures Rebar Crank Cannot Be Added To Shape Property |
| --- |

Cannot add crank to this type of Rebar Shape.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static FailureDefinitionId RebarCrankCannotBeAddedToShape { get; }
```

```
Public Shared ReadOnly Property RebarCrankCannotBeAddedToShape As FailureDefinitionId
	Get
```

```
public:
static property FailureDefinitionId^ RebarCrankCannotBeAddedToShape {
	FailureDefinitionId^ get ();
}
```

```
static member RebarCrankCannotBeAddedToShape : FailureDefinitionId with get
```

#### Property Value

FailureDefinitionId See Also

#### Reference

BuiltInFailures RebarFailures Class Autodesk.Revit.DB Namespace